---
layout: post
title: Lisp
date: 2020-05-16
categories: [man]
tags: [programming language]
author: "Max Kossek"
description: Personal reference for the Lisp functional programming language.
sitemap:
    lastmod: 2020-05-17
---

NAME
----

Lisp - Functional programming language.


DESCRIPTION
-----------

Lisp evaluates expressions in a read-eval-print loop. Start a Lisp source file with the shebang line `#!/usr/local/bin/sbcl --script` to run a program as a script.
```
$ sbcl
lisp> (load "file.lisp")
lisp> (quit)

$ sbcl --script file.lisp
```

Comment conventions:

`;;;;`
: Heading, aligned at the left margin.

`;;;`
: Subheading, aligned at the left margin.

`;;`
: Function documentation, indented with the code.

`;`
: Single line comment, located in the right column.

`""`
: Documentation strings, placed in the second line of a function.


INPUT / OUPUT
-------------

WRITE prints the standard representation of an object to standard output. PRIN1, PRINC, PRINT, and PPRINT print parameters so that they are suitable for input to READ.
```
(write "Hello World");
(write x)

(prin1 'a)
(print "Hello World")
```

FORMAT prints formatted output to standard output. FORMAT statements have the following form: (format [dest] "" [args ...]). The dest argument is one of: t (terminal), nil (string), or stream.

FORMAT takes in a number of formatting directives, that function similar to the directives of the `printf()` function in the C language.

~A - Aesthetic representation.

~D - Integer representation.

~F - Floating point representation.

~S - String representation of an object.

~% - New line character.

~{~} - List iteration.


READ reads a stream of characters from the standard input. READ-CHAR reads a single character, and READ-LINE reads a line.
```
(read)
(read-char)
(read-line)
```


DATA TYPES
----------

The primitive types are: INTEGER, FLOAT, CONS, SYMBOL, STRING, VECTOR, HASH-TABLE, SUBR, BYTE-CODE, RECORD.
```
> (+ 1 1)
2
> (+ 5 0.5)
5.5
> (+ 2/3 -3/4)
-1/12
> t
T
> nil
NIL
> (cons 1 2)
(1 . 2)
> 'a
A
> (char "abc" 0)
#\a
> "Hello World"
"Hello World"
> (defun func (x) (* x x))
FUNC
```


OPERATORS
---------

Arithemtic operators: +, -, *, /.
```
> (+ 1 2 3)
6
> (/ (* 6 5) 10)
3
> (+ 1.05e-10 3.14e-10)
4.19e-10
```

Mathematical functions: PI, EXP, EXPT, SIN, COS, TAN.
```
> pi
3.141592653589793d0
> (exp 1)
2.7182817
> (expt 5 2)
25
> (sin 1)
0.84147096
> (cos 1)
0.5403023
> (tan 1)
1.5574077
```

Bitwise operators: LOGNOT, LOGAND, LOGIOR, LOGXOR, ASH.
```
(lognot x)
(logand x y)
(logxor x y)
(ash x -1)
```

Equality operators: EQ, EQUAL, EQL. EQ tests for identical equality, EQUAL tests for comparative equality, and EQL tests for numerical equality.
```
> (eq 'a 'a)
T
> (eq '(1 2) '(1 2))
NIL
> (equal '(1 2) '(1 2))
T
> (eql '(1 2) '(1 2))
NIL
```

Boolean operators: AND, OR, NOT.
```
> (not T)
NIL
> (or (and T T) NIL)
T
```

Number equality: =, <, <=, >, >=.
```
(= x 0)
(> x 0)
(<= x 0)
```

Type equality: NUMBER=, CHAR=, STRING=.
```
> (char= #\a #\a)
T
> (string= "hello" "hel")
NIL
```


SPECIAL OPERATORS
-----------------

QUOTE signifies Lisp not to evaluate the following expression.
```
> '(quote (+ 1 2))
'(+ 1 2)
> '(+ 1 2)
(+ 1 2)
```

LET creates variable bindings.
```
> (let ((x 10) (y 5)) (+ x y))
15
```


STRINGS
-------

AREF or CHAR can be used to access characters inside a string. CONCATENATE concatenates two or more strings. LENGTH returns the length of a string.
```
> (char "abc" 0)
#\a
> (aref "abc" 2)
#\c

> (concatenate 'string "Hello " "World")
"Hello World"

> (length "hello")
5
```


LISTS
-----

A CONS is a pair of objects, where the first element is named the CAR and the second element (or list) is the CDR.
```
> (cons 1 nil)
(1)
> (cons 1 (cons 2 3))
(1 2 . 3)
```

LIST is simply syntactic sugar for chained together CONS's.
```
> '()
NIL
> (list 1 2 "hello" 'd)
(1 2 "hello" D)
> '(1 2 "hello" d)
(1 2 "hello" D)
> '(1 2 (3 4))
(1 2 (3 4))
```

CAR returns the first element of a list. CDR returns everything but the first element in the list. FIRST up to TENTH, or NTH can be used to index into the list.
```
> (car (list 1 2 3 4))
1
> (cdr (list 1 2 3 4))
(2 3 4)
> (fourth (list 1 2 "c" 'd))
D
> (nth 0 (list 1 2 3 'a))
1
```

SETF modifies list elements.
```
> (setf (car (list 0 2)) 1)
(0 1)
> (setf (cdr (list 1 2 3 4)) 5)
(1 . 5)
> (setf (third (list 1 2 "c")) 3)
(list 1 2 3)
> (setf (nth 1 (list 0 5 2)) 1)
(0 1 2)
```

Property lists map symbols to their values.
```
(list :a 1 :b 2 :c "c")
> (getf (list :a 1 :b 2 :c "c") :b)
2
```


LIST FUNCTIONS
--------------

LIST-LENGTH determines the length of a list. SORT sorts a list based on a specified ordering. REVERSE reverses the elements in a list. APPEND appends two lists. MEMBER checks if an element is in a list. If it is, then it returns the rest of the list, else NIL. FIND returns a matching element from the list if a match is found, or else NIL.
```
> (list-length '(1 2 3 4))
4
> (sort '(3 2 1 6 4) #'<)
(1 2 3 4 6)
> (reverse '(1 2 3))
(3 2 1)
> (append '(1 2) '(3))
(1 2 3)
> (member 2 '(1 2 3))
(2 3)
> (find 2 '(1 2 3))
2
```

FUNCALL calls a function on each element of a list. APPLY applies an operator to each element of a list. MAPCAR maps a function to each CAR element in a list.
```
> (funcall #'* 1 2 3 4)
24
> (apply #'+ '(1 2 3))
6
> (apply #'+ 10 '(1 2 3))
16
> (reduce #'- '(10 9 8))
-7
> (mapcar #'not '(T NIL 3))
(NIL T NIL)
> (mapcar #'(lambda (x) (+ x 1)) '(1 2 3))
(2 3 4)
```


ARRAYS
------

MAKE-ARRAY initializes an array. Elements of an array are accessed using AREF. SETF can be used to modify array elements.
```
> (setf x (make-array 3))
#(0 0 0)
> (make-array '(3 3))
#2A((0 0 0) (0 0 0) (0 0 0))

(aref x 0)
> (aref (make-array 3) 2)
0

> (setf (aref x 0) 1)
#(1 0 0)
(push 2 (aref x 1))
> (pop (aref x 1))
2
```


VARIABLES
---------

By convention, global variables names are written between the asterisk character ("*") `*GLOBAL-VAR*` and constant variable names are placed between plus characters ("+") `+CONST-VAR+`.

LET is a special operator that binds variables to values locally. DEFVAR and DEFPARAMETER are macros used to define dynamic variables. DEFVAR only assigns values to unbound variables, and does not require initialization. DEFPARAMETER assigns values to variables unconditionally, and requires initialization.
```
> (let ((x 1) (y 2)) (+ x y))
3

(defvar `global-variable`)
(defvar +size+ 5)
(defvar x 5)

(setq x 5)
(defparameter x 5)
(defparameter x "Hello World")
(defparameter x (list 1 2 3))
```


FUNCTIONS
---------

DEFUN declares a function.
```
(defun mult (x y)
 (* x y))

(mult 5 4)
```

&OPTIONAL specifies that the arguments to a function are optional. Default values for an optional argument set can be specified. The &REST keyword puts all the optional arguments into a list.
```
(defun func (x &optional y)
 (if y (+ x y) x))

(defun func (&optional (x 0) (y 0))
 (+ x y))

(defun func (x &rest y)
 (if y
  (reduce #'+ y)
  x))
```

LAMBDA defines a unnamed lambda function.
```
> ((lambda (x y) (+ x y)) 1 2)
3
```


STRUCTS
-------

DEFSTRUCT declares a struct. To instantiate a struct object use: MAKE-STRUCTNAME. Elements of a struct are accessed by concatenating the name of the struct with the field name: STRUCTNAME-FIELDNAME. The SETF function can modify the values inside a struct.
```
(defstruct person
 name phone email)

> (make-person)
#S(PERSON :NAME NIL :PHONE NIL :EMAIL NIL)
> (make-person :name "Max" :phone 1234567890)
#S(PERSON :NAME "Max" :PHONE 1234567890 :EMAIL NIL)

> (person-name *)
"Max"
(person-phone x)

(setf (person-name x) "John")
```


CONDITIONALS
------------

WHEN and UNLESS are one-branch expressions. IF statements are two-branch expressions. COND is used for multi-branch expressions.
```
(when (> x 0)
 (print "x greater than zero"))

(unless (>= x 0)
 (print "x is less than zero"))

(if (= x 0)
 "Zero"
 (- x 1))

(cond
 ((= x 0) "Zero")
 ((< x 0) "Negative")
 ("Positive"))
```

CASE statements compare the value of a variable to a set of different cases.
```
(case x
 (a 0)
 ((b c) 1)
 (otherwise 2))
```


LOOPS
-----

LOOP is a macro that is commonly used for list iteration.
```
(loop
 (setq i (- i 1))
 (setq x (+ x i))
 (when (= i 0) (return x)))

(defun sum (n)
 (loop for i from 1 to n
  for x = 0 then (+ x i)
  finally (return x)))
```

DOLIST iterates over a list, performing some function on each element.
```
(dolist (x '(1 2 3)) (setq y (+ x y)))
```


ERRORS
------

ERROR invokes an error signal. CERROR invokes an error on a condition. WARN issues a warning message.
```
(error "Explanation of what went wrong.")
(cerror "Return sqrt(~D) instead." "Tried to take sqrt(-~D)." n))
(warn "Number is currently greater than the maximum.")
```
